app/controllers/api/events_controller.rb

INSERT INTO "events" ("title", "organizer_name", "event_type", "event_category", "venue_name", "address", "timestamp_start", "timestamp_end", "capacity", "tickets_sold", "organizer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
    def create
        @event = Event.new(event_params)
        @event.timestamp_start = DateTime.new(2023,01,01)
        @event.timestamp_end = DateTime.new(2023,01,02)
        @event.organizer_id = current_user.id
        debugger
        if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "events" SET "updated_at" = $1, "description" = $2 WHERE "events"."id" = $3  [["updated_at", "2023-07-28 21:26:33.186618"], ["description", "test description 123"], ["id", 1]]
UPDATE "events" SET "updated_at" = $1, "price" = $2 WHERE "events"."id" = $3  [["updated_at", "2023-07-28 21:26:00.193269"], ["price", "25.0"], ["id", 1]]
---
    def update
        @event=Event.find(params[:id])

        if @event.organizer_id == current_user.id
            # @event.title=params[:title]
            # @event.organizer_name=params[:organizer_name]
            # @event.event_type=params[:event_type]
            # @event.event_category=params[:event_category]
            # @event.venue_name=params[:venue_name]
            # @event.address=params[:address]
            # @event.timestamp_start=params[:timestamp_start]
            # @event.timestamp_end=params[:timestamp_end]
            # @event.capacity=params[:capacity]
            # @event.price=params[:price]
            # @event.description=params[:description]
            @event.update(event_params)

            @event.save