app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "joe@hi.com"], ["LIMIT", 1]]
---
    def create
        email = params[:email]
        password = params[:password]
        @user = User.find_by_credentials(email, password)
        if @user
            login(@user)
            @user_organized_events = Event.where(organizer_id: @user.id)
            @user_attending_events = @user.attending_events
            @user_orders = @user.orders