app/controllers/api/users_controller.rb

    def index
        render json: {users: User.all}
---
SELECT "users".* FROM "users"

    def create

        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def show
        @user = User.find(params[:id])
        @user_organized_events = Event.where(organizer_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."organizer_id" = $1  [["organizer_id", 1]]