app/views/api/events/index.json.jbuilder

json.events do
    Event.all.each do |event|
---
SELECT "events".* FROM "events"