app/views/api/users/show.json.jbuilder

    json.img_url @user.profile_photo.url
    json.organized_events [Event.all.where(organizer_id: @user.id).map(&:id)]
---
SELECT "events".* FROM "events" WHERE "events"."organizer_id" = $1  [["organizer_id", 1]]