app/models/user.rb

    def self.find_by_credentials(email, pw)
        user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "joe@hi.com"], ["LIMIT", 1]]

    def generate_session_token
        loop do
            token = SecureRandom.urlsafe_base64
            return token unless User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]